export class QAData{
    constructor() {
        this.list =[
            {
                Q:"興味がある､今後触ってみたい技術や分野は?",
                A: `
* GraphQL
* fireBase
* FastAPi
* Flutter
* 機械学習
* ruby
* ruby on rails
* django
* golang
* PyScript
* 低レイヤー
* C言語
* GCP
* セキュリティ
* 電気工作
* テスト
* CI/CD
* デザイン
                `
            },
            {
                Q:"今後作ってみたいもの,技術的にやってみたいことは?",
                A:`
* laravelとvueを組み合わせたwebサービス
* GraphQLを使ったwebサービス
* 自作api
* ラインチャットボット
* サーバーから情報を取ってくるスマホアプリ
* Flutterを使ったスマホアプリ
* 自作ゲームに機械学習をしたコンピューターを搭載したい
* 自分用のブックマーク
* RasberyPyを使った電気工作
* awsの他の機能を使ってみたい
                `
            },
            {
                Q:"技術以外にやってみたいことなどは?",
                A:`
* 国内旅行
* 海外旅行
* 寝台列車に乗ってみたい
* 琵琶湖でウォータースポーツをしたい
* 地元のリゾートホテルに泊まってみたい
* 海外で働いてみたい
* 作曲
* ドラム演奏
* ピアノを引けるようになりたい
* 3Dモデルを作れるようになりたい
* RPGツクールなどで自作ゲームを作りたい
* 今まであまり物語系の本を読んで来なかったので読んで行きたい
* イベントに参加したい
* ゲームの大会に参加してみたい
                `
            },
            {
                Q:"最近の悩み事は?",
                A:`
周りに自分より圧倒的に技術力が高い方､学生時代にサービスを作って運営してる方  
実際に会社を経営している方など優秀な方々がたくさんいて｡自己否定､自己嫌悪に陥ってしまう｡
手汗をよくかく｡そして量が多い｡  
                `
            },
            {
                Q:"最近ハマっていることは?",
                A:`
* newsPicksの伝書鳩TVをみること
* PivotのPivotter,9Questionsをみること
                `
            },
        ]
    }
}